let handler = async (m, { conn }) => {
  let imgurl = 'https://files.catbox.moe/nmseef.png';
  const texto = `    [ꔊꔊꔊ[🍉] _*MENU - OWNER*_ [🍓]ꔊꔊꔊ]    
💥 𝐂𝐨𝐦𝐚𝐧𝐝𝐨𝐬 𝐝𝐞 𝐦𝐨𝐝𝐞𝐫𝐚𝐜𝐢𝐨𝐧 𝐲 𝐜𝐨𝐧𝐭𝐫𝐨𝐥 𝐚𝐯𝐚𝐧𝐳𝐚𝐝𝐨 𝐩𝐚𝐫𝐚 𝐨𝐰𝐧𝐞𝐫𝐬. 🌼

𖤓❴ *#α∂∂οωиєя • #∂єℓοωиєя*
> ✦ αgяєgα ο єℓιмιиα υи иúмєяο ∂є ℓα ℓιѕτα ∂є οωиєяѕ.

𖤓❴ *#ϲο∂ιgο*
> ✦ ϲяєα υи τοκєи ο ϲó∂ιgο ∂є ϲαиנєó ∂є ϲó∂ιgοѕ.

𖤓❴ *#ϐαϲκυρ • #ϲορια*
> ✦ ϲяєαя υи яєѕραℓ∂ο ∂є ѕєgυяι∂α∂ ∂є ℓα *∂ϐ* ∂єℓ ϐοτ.

𖤓❴ *#ϐϲgϲ*
> ✦ єиνια υи мєиѕαנє α το∂οѕ ℓοѕ gяυροѕ ∂οи∂є єѕτє єℓ ϐοτ.

𖤓❴ *#ϲℓєαиƒιℓєѕ*
> ✦ єℓιмιиα αяϲнινοѕ τємροяαℓєѕ.

𖤓❴ *#α∂∂ϲοιиѕ • #αñα∂ιяϲοιи*
> ✦ αñα∂є ϲοιиѕ α υи υѕυαяιο.

𖤓❴ *#υѕєяρяємιυм • #α∂∂ρяєм*
> ✦ οτοяgαя ρяємιυм α υи υѕυαяιο.

𖤓❴ *#∂єℓρяєм #яємονє*
> ✦ գυιταя ρяємιυм α υи υѕυαяιο.

𖤓❴ *#α∂∂єϰρ • #αñα∂ιяϰρ*
> ✦ αñα∂є ϰρ α υи υѕυαяιο.

𖤓❴ *#αυτοα∂мιи*
> ✦ єℓ ϐοτ ∂αяα α∂мιи αυτοмáτιϲαмєиτє ѕοℓο ѕι єℓ ϐοτ єѕ α∂мιи.

𖤓❴ *#ℓιѕτϐαи • #ϐαиℓιѕτ*
> ✦ ℓιѕτα ∂є υѕυαяιοѕ γ ϲнατѕ ϐαиєα∂οѕ.

𖤓❴ *#ϐαиυѕєя*
> ✦ ϐαиєαя α υи υѕυαяιο.

𖤓❴ *#υиϐαиυѕєя*
> ✦ ∂єѕϐαиєαя α υи υѕυαяιο.

𖤓❴ *#∂ѕοωиєя • #∂єℓαι*
> ✦ єℓιмιиα αяϲнινοѕ ιииєϲєѕαяιοѕ ∂є ѕєѕιóи.

𖤓❴ *#ϲℓєαяτмρ • #ναϲιαяτмρ*
> ✦ єℓιмιиα αяϲнινο ιииєϲєѕαяιοѕ ∂є ℓα ϲαяρєτα τмρ.

𖤓❴ *#ϐℓοϲκ • #υиϐℓοϲκ*
> ✦ ϐℓοգυєαя ο ∂єѕϐℓοգυєαя α υи υѕυαяιο ∂єℓ иúмєяο ∂єℓ ϐοτ.

𖤓❴ *#ℓιѕτϐℓοϲκ • #ϐℓοϲκℓιѕτ*
> ✦ νєя ℓιѕτα∂ο ∂є υѕυαяιοѕ ϐℓοգυєα∂οѕ.

𖤓❴ *#яємονєϲοιи • #գυιταяϲοιи*
> ✦ գυιταя ϲοιиѕ α υи υѕυαяιο.

𖤓❴ *#∂єℓєτє∂αταυѕєя • #яєѕєτυѕєя*
> ✦ яєѕταϐℓєϲєя ℓοѕ ∂ατοѕ ∂є υи υѕυαяιο.

𖤓❴ *#яємονєϰρ • #գυιταяϰρ*
> ✦ գυιταя ϰρ α υи υѕυαяιο.

𖤓❴ *#иєωgϲ #ϲяєαяgϲ*
> ✦ ϲяєα υи иυєνο gяυρο ∂єѕ∂є єℓ иúмєяο ∂єℓ ϐοτ.

𖤓❴ *#∂єℓєτєƒιℓє*
> ✦ єℓιмιиα αяϲнινοѕ ∂єℓ ϐοτ.

𖤓❴ *#gєτ • #ƒєτϲн*
> ✦ νєя єℓ єѕτα∂ο ∂є υиα ρágιиα ωєϐ.

𖤓❴ *#ρℓυgιи • #gєτρℓυgιи*
> ✦ єϰτяαєя υи ρℓυgιи ∂є ℓοѕ αяϲнινοѕ ∂єℓ ϐοτ.

𖤓❴ *#gяουρℓιѕτ • #ℓιѕτgяουρ*
> ✦ νєя ℓιѕτα∂ο ∂є gяυροѕ єи ℓοѕ գυє єѕτá υиι∂ο єℓ ϐοτ.

𖤓❴ *#נοιи • #ιиνιτє*
> ✦ αgяєgαя єℓ ϐοτ α υи gяυρο мє∂ιαиτє єℓ єиℓαϲє ∂є ιиνιταϲιóи.

𖤓❴ *#ℓєανє • #ѕαℓιя*
> ✦ ѕαϲαя єℓ ϐοτ ∂є υи gяυρο.

𖤓❴ *#ℓєτ*
> ✦ єиνια υи мєиѕαנє ϲοи υиα ∂υяαϲιóи ∂є 1 нοяα.

𖤓❴ *#ρяєƒιϰ*
> ✦ νєя ο ϲαмϐιαя єℓ ρяєƒιנο ∂єℓ ϐοτ.

𖤓❴ *#яєѕєτρяєƒιϰ*
> ✦ яєѕταϐℓєϲєя єℓ ρяєƒιנο ∂єℓ ϐοτ.

𖤓❴ *#яєιиιϲιαя • #яєѕταяτ*
> ✦ яєιиιϲιαя єℓ ѕєяνι∂οя ∂єℓ ϐοτ.

𖤓❴ *#яєυиιοи • #мєєτιиg*
> ✦ єиνια υи ανιѕο ∂є яєυиιóи α ℓοѕ οωиєяѕ.

𖤓❴ *#ѕανєנѕ • #ѕανєƒιℓє*
> ✦ gυαя∂α υи αяϲнινο єи υиα ∂є ℓαѕ яυταѕ ∂єℓ ϐοτ.

𖤓❴ *#ѕανєρℓυgιи*
> ✦ gυαя∂α υи ρℓυgιи єи ℓα ϲαяρєτα ∂є ϲοмαи∂οѕ ∂єℓ ϐοτ.

𖤓❴ *#ѕєτϐαииєя*
> ✦ ϲαмϐια ℓα ιмαgєи ∂єℓ мєиυ ρяιиϲιραℓ ∂єℓ ϐοτ.

𖤓❴ *#ѕєταναταя*
> ✦ ϲαмϐια ℓα ιмαgєи ∂єℓ ϲατáℓοgο.

𖤓❴ *#α∂∂ϲм∂ • #ѕєτϲм∂*
> ✦ gυαя∂α υи ѕτιϲκєя/ιмαgєи ϲοмο τєϰτο ο ϲοмαи∂ο.

𖤓❴ *#∂єℓϲм∂*
> ✦ єℓιмιиα єℓ τєϰτο/ϲοмαи∂ο ∂єℓ ϐοτ.

𖤓❴ *#ϲм∂ℓιѕτ • #ℓιѕτϲм∂*
> ✦ νєя ℓιѕτα∂ο ∂є τєϰτοѕ/ϲοмαи∂οѕ.

𖤓❴ *#ѕєτιмαgє • #ѕєτρƒρ*
> ✦ ϲαмϐια ℓα ƒοτο ∂єℓ ρєяƒιℓ ∂єℓ ϐοτ.

𖤓❴ *#ѕєτмοиє∂α*
> ✦ ϲαмϐια ℓα мοиє∂α ∂єℓ ϐοτ.

𖤓❴ *#ѕєτиαмє*
> ✦ ϲαмϐια єℓ иοмϐяє ∂єℓ ϐοτ.

𖤓❴ *#ѕєτϐιο • #ѕєτѕτατυѕ*
> ✦ ϲαмϐια ℓα ϐιοgяαƒíα ∂єℓ ϐοτ.

𖤓❴ *#υρ∂ατє*
> ✦ αϲτυαℓιzα єℓ ϐοτ α ℓα νєяѕιóи мáѕ яєϲιєиτє ∂є gιτнυϐ.

·٠•●♥ Ƹ̵̡Ӝ̵̨̄Ʒ ♥●•٠·˙ 🌲 ˙·٠•●♥ Ƹ̵̡Ӝ̵̨̄Ʒ ♥●•٠·˙
...`.trim();

  await conn.sendMessage(m.chat, {
    image: { url: imgurl },
    caption: texto,
    contextInfo: {
      mentionedJid: [m.sender],
      externalAdReply: {
        title: packname,
        body: dev,
        thumbnailUrl: icono,
        mediaType: 1,
        renderLargerThumbnail: false,
        showAdAttribution: true,
        mediaUrl: 'https://whatsapp.com/channel/0029VbAtbPA84OmJSLiHis2U',
        sourceUrl: 'https://whatsapp.com/channel/0029VbAtbPA84OmJSLiHis2U'
      }
    }
  }, { quoted: m });
};

handler.help = ['dev']
handler.tags = ['menus']
handler.command = ['dev', 'owners']

export default handler