let handler = async (m, { conn }) => {
  let imgurl = 'https://files.catbox.moe/nmseef.png';
  const texto = `ʜᴏʟᴀ
    ╔═══════ • ° ❁⊕❁ ° • ═══════╗
        💥⃢᭄͜═✩═[𝐌𝐄𝐍𝐔-𝐒𝐄𝐀𝐑𝐂𝐇]═✩═⃟⃢᭄͜🔎
    ╚═══════ • ° ❁⊕❁ ° • ═══════╝
      
> 🔍⊹ *𝐂𝐨𝐦𝐚𝐧𝐝𝐨𝐬 𝐝𝐞 𝐁𝐮́𝐬𝐪𝐮𝐞𝐝𝐚* ⊹🔎
  
━⃨⃛━╼─╍╍╍─╍▻◅╍─╍╍╼╼━⃨⃛╍╍
യ ׄ🌲˚ #sᴇᴀʀᴄʜʜᴇɴᴛᴀɪ
യ ׄ🌲˚ #ᴄᴜᴇᴠᴀɴᴀsᴇᴀʀᴄʜ
യ ׄ🌲˚ #ɢɪᴛʜᴜʙsᴇᴀʀᴄʜ
യ ׄ🌲˚ #ɢᴏᴏɢʟᴇ
യ ׄ🌲˚ #ɪᴍᴀɢᴇɴ *<ǫᴜᴇʀʏ>*
യ ׄ🌲˚ #ɪɴғᴏᴀɴɪᴍᴇ
യ ׄ🌲˚ #ɴᴘᴍᴊs
യ ׄ🌲˚ #ᴘɪɴᴛᴇʀᴇsᴛ  *<ǫᴜᴇʀʏ>*
യ ׄ🌲˚ #ᴘᴏʀɴʜᴜʙsᴇᴀʀᴄʜ
യ ׄ🌲˚ #sᴏᴜɴᴅᴄʟᴏᴜᴅsᴇᴀʀᴄʜ *<ᴛᴇxᴛᴏ>*
യ ׄ🌲˚ #sᴘᴏᴛɪғʏsᴇᴀʀᴄʜ *<ᴛᴇxᴛᴏ>*
യ ׄ🌲˚ #ᴛɪᴋᴛᴏᴋsᴇᴀʀᴄʜ *<ᴛᴇxᴛᴏ>*
യ ׄ🌲˚ #ᴛᴡᴇᴇᴛᴘᴏsᴛs
യ ׄ🌲˚ #xɴxxsᴇᴀʀᴄʜ *<ǫᴜᴇʀʏ>*
യ ׄ🌲˚ #xᴠɪᴅᴇᴏssᴇᴀʀᴄʜ
യ ׄ🌲˚ #ʏᴛsᴇᴀʀᴄʜ
യ ׄ🌲˚ #ʏᴛsᴇᴀʀᴄʜ2 *<ᴛᴇxᴛ>*
യ ׄ🌲˚ #ᴍᴏᴅs *<ǫᴜᴇʀʏ>*
യ ׄ🌲˚ #ɢɴᴜʟᴀ
യ ׄ🌲˚ #ᴀᴘᴋsᴇᴀʀᴄʜ
യ ׄ🌲˚ #ᴡɪᴋɪs
യ ׄ🌲˚ #ғᴅʀᴏɪᴅsᴇᴀʀᴄʜ *<ᴛᴇʀᴍɪɴᴏ>*
യ ׄ🌲˚ #ᴍᴏᴠɪᴇ *<ᴛᴇʀᴍɪɴᴏ>*
യ ׄ🌲˚ #ʜᴀᴘᴘʏᴍᴏᴅsᴇᴀʀᴄʜ *<ʙᴜsǫᴜᴇᴅᴀ>*
യ ׄ🌲˚ #ᴄɪɴᴇᴄᴀʟɪᴅᴀᴅsᴇᴀʀᴄʜ *<ʙᴜsǫᴜᴇᴅᴀ>*
യ ׄ🌲˚ #ʏᴀᴏᴏsᴇᴀʀᴄʜ *<ʙᴜsǫᴜᴇᴅᴀ>*

ֹི࣭࣭࣭࣭࣭࣮ׅ۪۪۪۪۪۪۪۪۪ٜ࣪࣪࣪࣪᷼✾ֹྀ࣭࣭࣭࣭࣭࣮ׅ۪۪۪۪۪۪۪۪۪ٜ࣪࣪࣪࣪᷼⏝𝐒𝐓𝐀𝐋𝐊⏝ֹི࣭࣭࣭࣭࣭࣮ׅ۪۪۪۪۪۪۪۪۪ٜ࣪࣪࣪࣪᷼✾ֹྀ࣭࣭࣭࣭࣭࣮ׅ۪۪۪۪۪۪۪۪۪ٜ࣪࣪࣪࣪᷼

❥ 📚 .githubstalk *<ǫᴜᴇʀʏ>*
❥ 🔥 .minestalk *<ɴᴏᴍʙʀᴇ ᴅᴇ ᴊᴜɢᴀᴅᴏʀ>*
❥ 🏔️ .kwaistalk *<ᴜsᴜᴀʀɪᴏ>*
❥ 🍓 .telegramstalk *<ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ>*
❥ 🌿 .tiktokstalk *<ᴜsᴜᴀʀɪᴏ>*
❥ 🍬 .youtubestalk *<ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ>*
❥ 🍬 .instagramstalk *<ᴜsᴜᴀʀɪᴏ>*
━⃨⃛━╼─╍╍╍─╍▻◅╍─╍╍╼╼━⃨⃛╍╍

> ${dev}`.trim();

  await conn.sendMessage(m.chat, {
    image: { url: imgurl },
    caption: texto,
    contextInfo: {
      mentionedJid: [m.sender],
      externalAdReply: {
        title: packname,
        body: dev,
        thumbnailUrl: icono,
        mediaType: 1,
        renderLargerThumbnail: false,
        showAdAttribution: true,
        mediaUrl: 'https://whatsapp.com/channel/0029VbAtbPA84OmJSLiHis2U',
        sourceUrl: 'https://whatsapp.com/channel/0029VbAtbPA84OmJSLiHis2U'
      }
    }
  }, { quoted: m });
};

handler.help = ['menusearch']
handler.tags = ['menus']
handler.command = ['menusearch', 'menuse']

export default handler
