function handler(m, { text, usedPrefix, command }) {
  let estilos = {
    1: { 'a':'ᥲ','b':'ᑲ','c':'ᥴ','d':'ძ','e':'ᥱ','f':'𝖿','g':'g','h':'һ','i':'і','j':'ȷ','k':'k','l':'ᥣ','m':'m','n':'ᥒ','o':'᥆','p':'⍴','q':'𝗊','r':'r','s':'s','t':'𝗍','u':'ᥙ','v':'᥎','w':'ᥕ','x':'᥊','y':'ᥡ','z':'z' },
    2: { 'a':'𝒂','b':'𝒃','c':'𝒄','d':'𝒅','e':'𝒆','f':'𝒇','g':'𝒈','h':'𝒉','i':'𝒊','j':'𝒋','k':'𝒌','l':'𝒍','m':'𝒎','n':'𝒏','o':'𝒐','p':'𝒑','q':'𝒒','r':'𝒓','s':'𝒔','t':'𝒕','u':'𝒖','v':'𝒗','w':'𝒘','x':'𝒙','y':'𝒚','z':'𝒛' },
    3: { 'a':'𝓪','b':'𝓫','c':'𝓬','d':'𝓭','e':'𝓮','f':'𝓯','g':'𝓰','h':'𝓱','i':'𝓲','j':'𝓳','k':'𝓴','l':'𝓵','m':'𝓶','n':'𝓷','o':'𝓸','p':'𝓹','q':'𝓺','r':'𝓻','s':'𝓼','t':'𝓽','u':'𝓾','v':'𝓿','w':'𝔀','x':'𝔁','y':'𝔂','z':'𝔃' },
    4: { 'a':'𝔞','b':'𝔟','c':'𝔠','d':'𝔡','e':'𝔢','f':'𝔣','g':'𝔤','h':'𝔥','i':'𝔦','j':'𝔧','k':'𝔨','l':'𝔩','m':'𝔪','n':'𝔫','o':'𝔬','p':'𝔭','q':'𝔮','r':'𝔯','s':'𝔰','t':'𝔱','u':'𝔲','v':'𝔳','w':'𝔴','x':'𝔵','y':'𝔶','z':'𝔷' },
    5: { 'a':'ⓐ','b':'ⓑ','c':'ⓒ','d':'ⓓ','e':'ⓔ','f':'ⓕ','g':'ⓖ','h':'ⓗ','i':'ⓘ','j':'ⓙ','k':'ⓚ','l':'ⓛ','m':'ⓜ','n':'ⓝ','o':'ⓞ','p':'ⓟ','q':'ⓠ','r':'ⓡ','s':'ⓢ','t':'ⓣ','u':'ⓤ','v':'ⓥ','w':'ⓦ','x':'ⓧ','y':'ⓨ','z':'ⓩ' },
    6: { 'a':'🅐','b':'🅑','c':'🅒','d':'🅓','e':'🅔','f':'🅕','g':'🅖','h':'🅗','i':'🅘','j':'🅙','k':'🅚','l':'🅛','m':'🅜','n':'🅝','o':'🅞','p':'🅟','q':'🅠','r':'🅡','s':'🅢','t':'🅣','u':'🅤','v':'🅥','w':'🅦','x':'🅧','y':'🅨','z':'🅩' },
    7: { 'a':'α','b':'в','c':'¢','d':'∂','e':'є','f':'ƒ','g':'g','h':'н','i':'ι','j':'נ','k':'к','l':'ℓ','m':'м','n':'η','o':'σ','p':'ρ','q':'q','r':'я','s':'ѕ','t':'т','u':'υ','v':'ν','w':'ω','x':'χ','y':'у','z':'z' },
    8: { 'a':'卂','b':'乃','c':'匚','d':'ᗪ','e':'乇','f':'千','g':'Ꮆ','h':'卄','i':'丨','j':'ﾌ','k':'Ҝ','l':'ㄥ','m':'爪','n':'几','o':'ㄖ','p':'卩','q':'Ɋ','r':'尺','s':'丂','t':'ㄒ','u':'ㄩ','v':'ᐯ','w':'山','x':'乂','y':'ㄚ','z':'乙' },
    9: { 'a':'ᴀ','b':'ʙ','c':'ᴄ','d':'ᴅ','e':'ᴇ','f':'ғ','g':'ɢ','h':'ʜ','i':'ɪ','j':'ᴊ','k':'ᴋ','l':'ʟ','m':'ᴍ','n':'ɴ','o':'ᴏ','p':'ᴘ','q':'ǫ','r':'ʀ','s':'s','t':'ᴛ','u':'ᴜ','v':'ᴠ','w':'ᴡ','x':'x','y':'ʏ','z':'ᴢ' },
    10:{ 'a':'ᴀ','b':'ʙ','c':'ᴄ','d':'ᴅ','e':'ᴇ','f':'ғ','g':'ɢ','h':'ʜ','i':'ɪ','j':'ᴊ','k':'ᴋ','l':'ʟ','m':'ᴍ','n':'ɴ','o':'ᴏ','p':'ᴘ','q':'Q','r':'ʀ','s':'ꜱ','t':'ᴛ','u':'ᴜ','v':'ᴠ','w':'ᴡ','x':'x','y':'ʏ','z':'ᴢ' },
    11:{ 'a':'ค','b':'๒','c':'ς','d':'๔','e':'є','f':'Ŧ','g':'ﻮ','h':'ђ','i':'เ','j':'ן','k':'к','l':'l','m':'๓','n':'ภ','o':'๏','p':'ק','q':'ợ','r':'г','s':'ร','t':'Շ','u':'ย','v':'ש','w':'ฬ','x':'א','y':'ץ','z':'չ' },
    12:{ 'a':'Λ','b':'B','c':'ᄃ','d':'D','e':'Σ','f':'F','g':'G','h':'Ή','i':'I','j':'J','k':'K','l':'ᄂ','m':'M','n':'Π','o':'Ө','p':'P','q':'Q','r':'Я','s':'Ƨ','t':'Ƭ','u':'Ц','v':'V','w':'Щ','x':'X','y':'Y','z':'Z' },
    13:{ 'a':'ą','b':'ც','c':'ƈ','d':'ɖ','e':'ɛ','f':'ʄ','g':'ɠ','h':'ɧ','i':'ı','j':'ʝ','k':'ƙ','l':'Ɩ','m':'ɱ','n':'ŋ','o':'ơ','p':'℘','q':'զ','r':'ཞ','s':'ʂ','t':'ƭ','u':'ų','v':'۷','w':'ῳ','x':'ҳ','y':'ყ','z':'ʑ' },
    14:{ 'a':'ค','b':'๖','c':'¢','d':'໓','e':'ē','f':'f','g':'ງ','h':'h','i':'i','j':'ว','k':'k','l':'l','m':'๓','n':'ຖ','o':'໐','p':'p','q':'๑','r':'r','s':'Ş','t':'t','u':'น','v':'ง','w':'ຟ','x':'x','y':'ฯ','z':'ຊ' },
    15:{ 'a':'ά','b':'в','c':'¢','d':'đ','e':'έ','f':'ғ','g':'ĝ','h':'ħ','i':'ί','j':'ј','k':'к','l':'ĺ','m':'м','n':'ή','o':'ό','p':'ρ','q':'q','r':'я','s':'ş','t':'ţ','u':'ù','v':'v','w':'ώ','x':'χ','y':'ў','z':'ź' },
    16:{ 'a':'ᴀ','b':'ʙ','c':'ᴄ','d':'ᴅ','e':'ᴇ','f':'ғ','g':'ɢ','h':'ʜ','i':'ɪ','j':'ᴊ','k':'ᴋ','l':'ʟ','m':'ᴍ','n':'ɴ','o':'ᴏ','p':'ᴘ','q':'ǫ','r':'ʀ','s':'ꜱ','t':'ᴛ','u':'ᴜ','v':'ᴠ','w':'ᴡ','x':'x','y':'ʏ','z':'ᴢ' },
    17:{ 'a':'å','b':'ß','c':'¢','d':'Ð','e':'ê','f':'£','g':'g','h':'h','i':'ï','j':'j','k':'k','l':'l','m':'m','n':'n','o':'¤','p':'þ','q':'q','r':'r','s':'§','t':'†','u':'µ','v':'v','w':'w','x':'×','y':'¥','z':'z' },
    18:{ 'a':'ᗩ','b':'ᗷ','c':'ᑕ','d':'ᗪ','e':'E','f':'ᖴ','g':'G','h':'ᕼ','i':'I','j':'ᒍ','k':'K','l':'ᒪ','m':'ᗰ','n':'ᑎ','o':'O','p':'ᑭ','q':'ᑫ','r':'ᖇ','s':'ᔕ','t':'T','u':'ᑌ','v':'ᐯ','w':'ᗯ','x':'᙭','y':'Y','z':'ᘔ' },
    19:{ 'a':'𝗮','b':'𝗯','c':'𝗰','d':'𝗱','e':'𝗲','f':'𝗳','g':'𝗴','h':'𝗵','i':'𝗶','j':'𝗷','k':'𝗸','l':'𝗹','m':'𝗺','n':'𝗻','o':'𝗼','p':'𝗽','q':'𝗾','r':'𝗿','s':'𝘀','t':'𝘁','u':'𝘂','v':'𝘃','w':'𝘄','x':'𝘅','y':'𝘆','z':'𝘇' },
    20:{ 'a':'₳','b':'฿','c':'₵','d':'Đ','e':'Ɇ','f':'₣','g':'₲','h':'Ⱨ','i':'ł','j':'J','k':'₭','l':'Ⱡ','m':'₥','n':'₦','o':'Ø','p':'₱','q':'Q','r':'Ɽ','s':'₴','t':'₮','u':'Ʉ','v':'V','w':'₩','x':'Ӿ','y':'Ɏ','z':'Ⱬ' }
  }

  if (!text) {
    let ejemplo = "Texto"
    let lista = Object.keys(estilos).map(n => {
      let convertido = ejemplo.replace(/[a-z]/gi, v => estilos[n][v.toLowerCase()] || v)
      return `*${n}* ➤ ${convertido}`
    }).join("\n")

    return m.reply(`✨ 𝗘𝗟𝗜𝗝𝗘 𝗨𝗡 𝗘𝗦𝗧𝗜𝗟𝗢 𝗗𝗘 𝗟𝗘𝗧𝗥𝗔 ✨\n\nUsa:\n${usedPrefix + command} <número> <texto>\n\nEjemplo:\n${usedPrefix + command} 5 Hola Mundo\n\nLista de estilos:\n\n${lista}`)
  }

  let [num, ...txt] = text.split(' ')
  num = parseInt(num)
  let frase = txt.join(' ')
  if (!estilos[num]) return m.reply(`⚠️ Estilo no encontrado. Usa un número entre 1 y 20.`)

  let convertido = frase.replace(/[a-z]/gi, v => estilos[num][v.toLowerCase()] || v)
  m.reply(convertido)
}

handler.help = ['letra2 <estilo> <texto>']
handler.tags = ['fun']
handler.command = ['letra2']
handler.register = true

export default handler